<a href="https://colab.research.google.com/github/victor048/series-pandas/blob/main/series%26pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data = np.array(['l','i','v','e'])

In [ ]:
data

array(['l', 'i', 'v', 'e'], dtype='<U1')

In [ ]:
ser = pd.Series(data)
ser

0    l
1    i
2    v
3    e
dtype: object

In [ ]:
type(ser)

pandas.core.series.Series

In [ ]:
m3 =  pd.Series(np.random.randn(5), index=['A','B','C','D','E'])
m3

A    0.592146
B    0.170135
C   -1.112828
D    2.270665
E    1.122533
dtype: float64

In [ ]:
d = {'SP':'são paulo','RJ':'rio de janeiro','MG':'minas gerais'}

In [ ]:
d

{'MG': 'minas gerais', 'RJ': 'rio de janeiro', 'SP': 'são paulo'}

In [ ]:
ser_d = pd.Series(d)
ser_d

SP         são paulo
RJ    rio de janeiro
MG      minas gerais
dtype: object

In [ ]:
d2 = {'SP':['são paulo','rio de janeiro','minas gerais'],'RJ':'rio de janeiro','MA':'maranhão'}

In [ ]:
d2

{'MA': 'maranhão',
 'RJ': 'rio de janeiro',
 'SP': ['são paulo', 'rio de janeiro', 'minas gerais']}

In [ ]:
ser_d2 = pd.Series(d2)
ser_d2

SP    [são paulo, rio de janeiro, minas gerais]
RJ                               rio de janeiro
MA                                     maranhão
dtype: object

In [ ]:
# DATAFRAME:

In [ ]:
data_dict = {'NOMES':['VICTOR','LARISSA','JOSE'],
             'SOBRENOME':['LACERDA','BARBOSA','RODIGO'],
             'GENERO':['M','F','M']
             }

In [ ]:
df = pd.DataFrame(data_dict, index=['A','B','C'])
df

     NOMES SOBRENOME GENERO
A   VICTOR   LACERDA      M
B  LARISSA   BARBOSA      F
C     JOSE    RODIGO      M

In [ ]:
data_list_tuple = [
                   ('01-03-2021', 23,'Victor'),
                   ('02-03-2020', 22, 'Larissa'),
                   ('02-04-2020', 21, 'Jose')]

In [ ]:
df2 = pd.DataFrame(data_list_tuple, columns=['Data','Idade','Nome'])
df2

         Data  Idade     Nome
0  01-03-2021     23   Victor
1  02-03-2020     22  Larissa
2  02-04-2020     21     Jose

In [ ]:
type(df2)

pandas.core.frame.DataFrame

In [ ]:
df = pd.read_csv('/content/historical_data.csv')

In [ ]:
df

            Date  Close   Open   High    Low   Volume  Variation
0     22-12-2000  10.26  10.38  10.90  10.05  531.07K      -1.16
1     26-12-2000  10.18  10.18  10.26  10.05  202.79K      -0.78
2     27-12-2000  10.26  10.18  10.37   9.97  450.69K       0.79
3     28-12-2000  10.43  10.31  10.43   9.97  962.21K       1.66
4     02-01-2001  10.98  10.15  10.98  10.15  939.17K       5.27
...          ...    ...    ...    ...    ...      ...        ...
4985  22-02-2021  12.48  11.20  12.77  11.11   36.29M       7.40
4986  23-02-2021  12.35  12.68  12.68  11.67   21.37M      -1.04
4987  24-02-2021  13.10  12.44  13.33  12.20   25.17M       6.07
4988  25-02-2021  12.27  13.07  13.22  12.21   21.11M      -6.34
4989  26-02-2021  12.23  12.31  12.42  11.79   17.92M      -0.33

[4990 rows x 7 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4990 entries, 0 to 4989
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       4990 non-null   object
 1   Close      4990 non-null   float64
 2   Open       4990 non-null   float64
 3   High       4990 non-null   float64
 4   Low        4990 non-null   float64
 5   Volume     4990 non-null   object
 6   Variation  4990 non-null   float64
dtypes: float64(5), object(2)
memory usage: 273.0+ KB

In [ ]:
df.describe()

             Close         Open         High          Low    Variation
count  4990.000000  4990.000000  4990.000000  4990.000000  4990.000000
mean     14.963180    14.979377    15.212719    14.711693     0.036735
std       5.050776     5.050885     5.105678     4.992045     2.580234
min       5.110000     5.150000     5.300000     4.880000   -26.440000
25%      10.930000    10.942500    11.140000    10.740000    -1.270000
50%      14.660000    14.690000    14.900000    14.360000     0.000000
75%      18.650000    18.670000    18.910000    18.420000     1.320000
max      30.360000    30.490000    30.770000    30.050000    22.490000

In [ ]:
# Renomeando minhas colunas
df.columns

Index(['Date', 'Close', 'Open', 'High', 'Low', 'Volume', 'Variation'], dtype='object')

In [ ]:
df.rename(columns={'Date':'Data', 'Close':'Fechamento', 'Open':'Abertura', 'High':'Maior', 'Low':'Menor','Variation':'variação'}, inplace=True)

In [ ]:
df.head()

         Data  Fechamento  Abertura  Maior  Menor   Volume  variação
0  22-12-2000       10.26     10.38  10.90  10.05  531.07K     -1.16
1  26-12-2000       10.18     10.18  10.26  10.05  202.79K     -0.78
2  27-12-2000       10.26     10.18  10.37   9.97  450.69K      0.79
3  28-12-2000       10.43     10.31  10.43   9.97  962.21K      1.66
4  02-01-2001       10.98     10.15  10.98  10.15  939.17K      5.27